1) /home/loic/www/others/symfony-starter/src/Context/CustomerContext.php:52    [M] Identical

--- Original
+++ New
@@ @@
      */
     public function getCustomer() : ?CustomerInterface
     {
-        if (null === ($token = $this->tokenStorage->getToken())) {
+        if (null !== ($token = $this->tokenStorage->getToken())) {
             return null;
         }
         if ($this->authorizationChecker->isGranted('IS_AUTHENTICATED_REMEMBERED') && $token->getUser() instanceof UserInterface) {

2) /home/loic/www/others/symfony-starter/src/Context/CustomerContext.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (null === ($token = $this->tokenStorage->getToken())) {
             return null;
         }
-        if ($this->authorizationChecker->isGranted('IS_AUTHENTICATED_REMEMBERED') && $token->getUser() instanceof UserInterface) {
+        if ($this->authorizationChecker->isGranted('IS_AUTHENTICATED_REMEMBERED') || $token->getUser() instanceof UserInterface) {
             return $token->getUser()->getCustomer();
         }
         return null;
     }

37) /home/loic/www/others/symfony-starter/src/EventListener/PasswordUpdaterListener.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param GenericEvent $event
      */
-    public function customerUpdateEvent(GenericEvent $event)
+    protected function customerUpdateEvent(GenericEvent $event)
     {
         $customer = $event->getSubject();
         if (!$customer instanceof CustomerInterface) {

38) /home/loic/www/others/symfony-starter/src/EventListener/PasswordUpdaterListener.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function customerUpdateEvent(GenericEvent $event)
     {
         $customer = $event->getSubject();
-        if (!$customer instanceof CustomerInterface) {
+        if ($customer instanceof CustomerInterface) {
             throw new UnexpectedTypeException($customer, CustomerInterface::class);
         }
         if (null !== ($user = $customer->getUser())) {

39) /home/loic/www/others/symfony-starter/src/EventListener/PasswordUpdaterListener.php:33    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $customer = $event->getSubject();
         if (!$customer instanceof CustomerInterface) {
-            throw new UnexpectedTypeException($customer, CustomerInterface::class);
+            new UnexpectedTypeException($customer, CustomerInterface::class);
         }
         if (null !== ($user = $customer->getUser())) {
             $this->updatePassword($user);

40) /home/loic/www/others/symfony-starter/src/EventListener/PasswordUpdaterListener.php:39    [M] NotIdentical

--- Original
+++ New
@@ @@
         if (!$customer instanceof CustomerInterface) {
             throw new UnexpectedTypeException($customer, CustomerInterface::class);
         }
-        if (null !== ($user = $customer->getUser())) {
+        if (null === ($user = $customer->getUser())) {
             $this->updatePassword($user);
         }
     }
 }

41) /home/loic/www/others/symfony-starter/src/EventListener/PasswordUpdaterListener.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new UnexpectedTypeException($customer, CustomerInterface::class);
         }
         if (null !== ($user = $customer->getUser())) {
-            $this->updatePassword($user);
+            
         }
     }
 }

153) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:168    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {
             $defaults['_sylius']['serialization_groups'] = ['Default', 'Detailed'];
         }
-        if ($isApi && 'delete' === $actionName) {
+        if ($isApi || 'delete' === $actionName) {
             $defaults['_sylius']['csrf_protection'] = false;
         }
         if (isset($configuration['grid']) && 'index' === $actionName) {

154) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:168    [M] Identical

--- Original
+++ New
@@ @@
         if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {
             $defaults['_sylius']['serialization_groups'] = ['Default', 'Detailed'];
         }
-        if ($isApi && 'delete' === $actionName) {
+        if ($isApi && 'delete' !== $actionName) {
             $defaults['_sylius']['csrf_protection'] = false;
         }
         if (isset($configuration['grid']) && 'index' === $actionName) {

155) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:169    [M] FalseValue

--- Original
+++ New
@@ @@
             $defaults['_sylius']['serialization_groups'] = ['Default', 'Detailed'];
         }
         if ($isApi && 'delete' === $actionName) {
-            $defaults['_sylius']['csrf_protection'] = false;
+            $defaults['_sylius']['csrf_protection'] = true;
         }
         if (isset($configuration['grid']) && 'index' === $actionName) {
             $defaults['_sylius']['grid'] = $configuration['grid'];

156) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:171    [M] Identical

--- Original
+++ New
@@ @@
         if ($isApi && 'delete' === $actionName) {
             $defaults['_sylius']['csrf_protection'] = false;
         }
-        if (isset($configuration['grid']) && 'index' === $actionName) {
+        if (isset($configuration['grid']) && 'index' !== $actionName) {
             $defaults['_sylius']['grid'] = $configuration['grid'];
         }
         if (isset($configuration['form']) && in_array($actionName, ['create', 'update'], true)) {

157) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:171    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($isApi && 'delete' === $actionName) {
             $defaults['_sylius']['csrf_protection'] = false;
         }
-        if (isset($configuration['grid']) && 'index' === $actionName) {
+        if (isset($configuration['grid']) || 'index' === $actionName) {
             $defaults['_sylius']['grid'] = $configuration['grid'];
         }
         if (isset($configuration['form']) && in_array($actionName, ['create', 'update'], true)) {
