1) /home/loic/www/others/symfony-starter/src/Entity/AppUser.php:51    [M] This

--- Original
+++ New
@@ @@
     public function setCustomer($customer)
     {
         $this->customer = $customer;
-        return $this;
+        return null;
     }
     /**
      * @param Customer $customer

2) /home/loic/www/others/symfony-starter/src/Entity/Customer.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         if ($this->user !== $user) {
             $this->user = $user;
-            $this->assignCustomer($user);
+            
         }
         return $this;
     }

3) /home/loic/www/others/symfony-starter/src/Entity/Customer.php:57    [M] This

--- Original
+++ New
@@ @@
             $this->user = $user;
             $this->assignCustomer($user);
         }
-        return $this;
+        return null;
     }
     /**
      * @param AppUser|null $user

4) /home/loic/www/others/symfony-starter/src/Entity/Customer.php:63    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     /**
      * @param AppUser|null $user
      */
-    protected function assignCustomer($user = null)
+    private function assignCustomer($user = null)
     {
         if (null !== $user) {
             $user->setCustomer($this);

5) /home/loic/www/others/symfony-starter/src/Entity/Customer.php:65    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function assignCustomer($user = null)
     {
-        if (null !== $user) {
+        if (null === $user) {
             $user->setCustomer($this);
         }
     }
 }

6) /home/loic/www/others/symfony-starter/src/Entity/Customer.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function assignCustomer($user = null)
     {
         if (null !== $user) {
-            $user->setCustomer($this);
+            
         }
     }
 }

Timed Out mutants:
==================

Not Covered mutants:
====================

4) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string
      */
-    public function getLastName()
+    protected function getLastName()
     {
         return $this->lastName;
     }

5) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return $this
      */
-    public function setLastName($lastName)
+    protected function setLastName($lastName)
     {
         $this->lastName = $lastName;
         return $this;

6) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:68    [M] This

--- Original
+++ New
@@ @@
     public function setLastName($lastName)
     {
         $this->lastName = $lastName;
-        return $this;
+        return null;
     }
     /**
      * @return string

7) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string
      */
-    public function getFirstName()
+    protected function getFirstName()
     {
         return $this->firstName;
     }

8) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return $this
      */
-    public function setFirstName($firstName)
+    protected function setFirstName($firstName)
     {
         $this->firstName = $firstName;
         return $this;
     }

9) /home/loic/www/others/symfony-starter/src/Entity/AdminUser.php:88    [M] This

--- Original
+++ New
@@ @@
     public function setFirstName($firstName)
     {
         $this->firstName = $firstName;
-        return $this;
+        return null;
     }
 }

10) /home/loic/www/others/symfony-starter/src/Entity/AppUser.php:57    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     /**
      * @param Customer $customer
      */
-    protected function assignUser(Customer $customer = null)
+    private function assignUser(Customer $customer = null)
     {
         if (null !== $customer) {
             $customer->setUser($this);

11) /home/loic/www/others/symfony-starter/src/Entity/AppUser.php:59    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function assignUser(Customer $customer = null)
     {
-        if (null !== $customer) {
+        if (null === $customer) {
             $customer->setUser($this);
         }
     }
 }

12) /home/loic/www/others/symfony-starter/src/Entity/AppUser.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function assignUser(Customer $customer = null)
     {
         if (null !== $customer) {
-            $customer->setUser($this);
+            
         }
     }
 }

13) /home/loic/www/others/symfony-starter/src/Entity/IdentifiableTrait.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return int
      */
-    public function getId()
+    protected function getId()
     {
         return $this->id;
     }
 }

14) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param LifecycleEventArgs $event
      */
-    public function canonicalize(LifecycleEventArgs $event)
+    protected function canonicalize(LifecycleEventArgs $event)
     {
         $item = $event->getEntity();
         if ($item instanceof CustomerInterface) {

15) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $item = $event->getEntity();
         if ($item instanceof CustomerInterface) {
-            $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));
+            
         } elseif ($item instanceof UserInterface) {
             $item->setUsernameCanonical($this->canonicalizer->canonicalize($item->getUsername()));
             $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));

16) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($item instanceof CustomerInterface) {
             $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));
         } elseif ($item instanceof UserInterface) {
-            $item->setUsernameCanonical($this->canonicalizer->canonicalize($item->getUsername()));
+            
             $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));
         }
     }

17) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));
         } elseif ($item instanceof UserInterface) {
             $item->setUsernameCanonical($this->canonicalizer->canonicalize($item->getUsername()));
-            $item->setEmailCanonical($this->canonicalizer->canonicalize($item->getEmail()));
+            
         }
     }
     /**

18) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param LifecycleEventArgs $event
      */
-    public function prePersist(LifecycleEventArgs $event)
+    protected function prePersist(LifecycleEventArgs $event)
     {
         $this->canonicalize($event);
     }

19) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function prePersist(LifecycleEventArgs $event)
     {
-        $this->canonicalize($event);
+        
     }
     /**
      * @param LifecycleEventArgs $event

20) /home/loic/www/others/symfony-starter/src/EventListener/CanonicalizerListener.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param LifecycleEventArgs $event
      */
-    public function preUpdate(LifecycleEventArgs $event)
+    protected function preUpdate(LifecycleEventArgs $event)
     {
         $this->canonicalize($event);
     }
 }

22) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param OnFlushEventArgs $onFlushEventArgs
      */
-    public function onFlush(OnFlushEventArgs $onFlushEventArgs)
+    protected function onFlush(OnFlushEventArgs $onFlushEventArgs)
     {
         $entityManager = $onFlushEventArgs->getEntityManager();
         $unitOfWork = $entityManager->getUnitOfWork();

23) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $entityManager = $onFlushEventArgs->getEntityManager();
         $unitOfWork = $entityManager->getUnitOfWork();
-        $this->processEntities($unitOfWork->getScheduledEntityInsertions(), $entityManager, $unitOfWork);
+        
         $this->processEntities($unitOfWork->getScheduledEntityUpdates(), $entityManager, $unitOfWork);
     }
     /**

24) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $entityManager = $onFlushEventArgs->getEntityManager();
         $unitOfWork = $entityManager->getUnitOfWork();
         $this->processEntities($unitOfWork->getScheduledEntityInsertions(), $entityManager, $unitOfWork);
-        $this->processEntities($unitOfWork->getScheduledEntityUpdates(), $entityManager, $unitOfWork);
+        
     }
     /**
      * @param array                  $entities

25) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:46    [M] Foreach_

--- Original
+++ New
@@ @@
      */
     private function processEntities($entities, EntityManagerInterface $entityManager, UnitOfWork $unitOfWork)
     {
-        foreach ($entities as $customer) {
+        foreach (array() as $customer) {
             if (!$customer instanceof CustomerInterface) {
                 continue;
             }

26) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function processEntities($entities, EntityManagerInterface $entityManager, UnitOfWork $unitOfWork)
     {
         foreach ($entities as $customer) {
-            if (!$customer instanceof CustomerInterface) {
+            if ($customer instanceof CustomerInterface) {
                 continue;
             }
             /** @var UserInterface $user */

27) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:48    [M] Continue_

--- Original
+++ New
@@ @@
     {
         foreach ($entities as $customer) {
             if (!$customer instanceof CustomerInterface) {
-                continue;
+                break;
             }
             /** @var UserInterface $user */
             $user = $customer->getUser();

28) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:54    [M] Identical

--- Original
+++ New
@@ @@
             }
             /** @var UserInterface $user */
             $user = $customer->getUser();
-            if (null === $user) {
+            if (null !== $user) {
                 continue;
             }
             if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {

29) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:55    [M] Continue_

--- Original
+++ New
@@ @@
             /** @var UserInterface $user */
             $user = $customer->getUser();
             if (null === $user) {
-                continue;
+                break;
             }
             if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
                 continue;

30) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:58    [M] Identical

--- Original
+++ New
@@ @@
             if (null === $user) {
                 continue;
             }
-            if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
+            if ($customer->getEmail() !== $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
                 continue;
             }
             $user->setUsername($customer->getEmail());

31) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:58    [M] Identical

--- Original
+++ New
@@ @@
             if (null === $user) {
                 continue;
             }
-            if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
+            if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() !== $user->getUsernameCanonical()) {
                 continue;
             }
             $user->setUsername($customer->getEmail());

32) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:58    [M] LogicalAnd

--- Original
+++ New
@@ @@
             if (null === $user) {
                 continue;
             }
-            if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
+            if ($customer->getEmail() === $user->getUsername() || $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
                 continue;
             }
             $user->setUsername($customer->getEmail());

33) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:59    [M] Continue_

--- Original
+++ New
@@ @@
                 continue;
             }
             if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
-                continue;
+                break;
             }
             $user->setUsername($customer->getEmail());
             $user->setUsernameCanonical($customer->getEmailCanonical());

34) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($customer->getEmail() === $user->getUsername() && $customer->getEmailCanonical() === $user->getUsernameCanonical()) {
                 continue;
             }
-            $user->setUsername($customer->getEmail());
+            
             $user->setUsernameCanonical($customer->getEmailCanonical());
             /** @var ClassMetadata $userMetadata */
             $userMetadata = $entityManager->getClassMetadata(get_class($user));

35) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 continue;
             }
             $user->setUsername($customer->getEmail());
-            $user->setUsernameCanonical($customer->getEmailCanonical());
+            
             /** @var ClassMetadata $userMetadata */
             $userMetadata = $entityManager->getClassMetadata(get_class($user));
             $unitOfWork->recomputeSingleEntityChangeSet($userMetadata, $user);

36) /home/loic/www/others/symfony-starter/src/EventListener/DefaultUsernameORMListener.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setUsernameCanonical($customer->getEmailCanonical());
             /** @var ClassMetadata $userMetadata */
             $userMetadata = $entityManager->getClassMetadata(get_class($user));
-            $unitOfWork->recomputeSingleEntityChangeSet($userMetadata, $user);
+            
         }
     }
 }

42) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param FormEvent $event
      */
-    public function preSetData(FormEvent $event)
+    protected function preSetData(FormEvent $event)
     {
         $form = $event->getForm();
         $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);

43) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function preSetData(FormEvent $event)
     {
         $form = $event->getForm();
-        $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
+        
         $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => false, 'mapped' => false]);
     }
     /**

44) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $form = $event->getForm();
         $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
-        $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => false, 'mapped' => false]);
+        
     }
     /**
      * @param FormEvent $event

45) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:61    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $form = $event->getForm();
         $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
-        $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => false, 'mapped' => false]);
+        $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => true, 'mapped' => false]);
     }
     /**
      * @param FormEvent $event

46) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:62    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $form = $event->getForm();
         $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
-        $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => false, 'mapped' => false]);
+        $form->add('createUser', CheckboxType::class, ['label' => 'app.ui.create_user', 'required' => false, 'mapped' => true]);
     }
     /**
      * @param FormEvent $event

47) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param FormEvent $event
      */
-    public function submit(FormEvent $event)
+    protected function submit(FormEvent $event)
     {
         $data = $event->getData();
         $form = $event->getForm();

48) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:74    [M] Identical

--- Original
+++ New
@@ @@
     {
         $data = $event->getData();
         $form = $event->getForm();
-        if (null === $form->get('createUser')->getViewData()) {
+        if (null !== $form->get('createUser')->getViewData()) {
             Assert::isInstanceOf($data, UserAwareInterface::class);
             $data->setUser(null);
             $event->setData($data);

49) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $data = $event->getData();
         $form = $event->getForm();
         if (null === $form->get('createUser')->getViewData()) {
-            Assert::isInstanceOf($data, UserAwareInterface::class);
+            
             $data->setUser(null);
             $event->setData($data);
             $form->remove('user');

50) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $event->getForm();
         if (null === $form->get('createUser')->getViewData()) {
             Assert::isInstanceOf($data, UserAwareInterface::class);
-            $data->setUser(null);
+            
             $event->setData($data);
             $form->remove('user');
             $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);

51) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null === $form->get('createUser')->getViewData()) {
             Assert::isInstanceOf($data, UserAwareInterface::class);
             $data->setUser(null);
-            $event->setData($data);
+            
             $form->remove('user');
             $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
         }
     }

52) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             Assert::isInstanceOf($data, UserAwareInterface::class);
             $data->setUser(null);
             $event->setData($data);
-            $form->remove('user');
+            
             $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
         }
     }
 }

53) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/AddUserFormSubscriber.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $data->setUser(null);
             $event->setData($data);
             $form->remove('user');
-            $form->add('user', $this->entryType, ['constraints' => [new Valid()]]);
+            
         }
     }
 }

54) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * {@inheritdoc}
      */
-    public function preSubmit(FormEvent $event)
+    protected function preSubmit(FormEvent $event)
     {
         $rawData = $event->getData();
         $form = $event->getForm();

55) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:58    [M] LogicalNot

--- Original
+++ New
@@ @@
         $rawData = $event->getData();
         $form = $event->getForm();
         $data = $form->getData();
-        if (!$data instanceof CustomerInterface) {
+        if ($data instanceof CustomerInterface) {
             throw new UnexpectedTypeException($data, CustomerInterface::class);
         }
         // if email is not filled in, go on

56) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:59    [M] Throw_

--- Original
+++ New
@@ @@
         $form = $event->getForm();
         $data = $form->getData();
         if (!$data instanceof CustomerInterface) {
-            throw new UnexpectedTypeException($data, CustomerInterface::class);
+            new UnexpectedTypeException($data, CustomerInterface::class);
         }
         // if email is not filled in, go on
         if (!isset($rawData['email']) || empty($rawData['email'])) {

57) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:63    [M] LogicalOr

--- Original
+++ New
@@ @@
             throw new UnexpectedTypeException($data, CustomerInterface::class);
         }
         // if email is not filled in, go on
-        if (!isset($rawData['email']) || empty($rawData['email'])) {
+        if (!isset($rawData['email']) && empty($rawData['email'])) {
             return;
         }
         $existingCustomer = $this->customerRepository->findOneBy(['email' => $rawData['email']]);

58) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:63    [M] LogicalNot

--- Original
+++ New
@@ @@
             throw new UnexpectedTypeException($data, CustomerInterface::class);
         }
         // if email is not filled in, go on
-        if (!isset($rawData['email']) || empty($rawData['email'])) {
+        if (isset($rawData['email']) || empty($rawData['email'])) {
             return;
         }
         $existingCustomer = $this->customerRepository->findOneBy(['email' => $rawData['email']]);

59) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:67    [M] LogicalOr

--- Original
+++ New
@@ @@
             return;
         }
         $existingCustomer = $this->customerRepository->findOneBy(['email' => $rawData['email']]);
-        if (null === $existingCustomer || null !== $existingCustomer->getUser()) {
+        if (null === $existingCustomer && null !== $existingCustomer->getUser()) {
             return;
         }
         $existingCustomer->setUser($data->getUser());

60) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:67    [M] NotIdentical

--- Original
+++ New
@@ @@
             return;
         }
         $existingCustomer = $this->customerRepository->findOneBy(['email' => $rawData['email']]);
-        if (null === $existingCustomer || null !== $existingCustomer->getUser()) {
+        if (null === $existingCustomer || null === $existingCustomer->getUser()) {
             return;
         }
         $existingCustomer->setUser($data->getUser());

61) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:67    [M] Identical

--- Original
+++ New
@@ @@
             return;
         }
         $existingCustomer = $this->customerRepository->findOneBy(['email' => $rawData['email']]);
-        if (null === $existingCustomer || null !== $existingCustomer->getUser()) {
+        if (null !== $existingCustomer || null !== $existingCustomer->getUser()) {
             return;
         }
         $existingCustomer->setUser($data->getUser());

62) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:71    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null === $existingCustomer || null !== $existingCustomer->getUser()) {
             return;
         }
-        $existingCustomer->setUser($data->getUser());
+        
         $form->setData($existingCustomer);
     }
 }

63) /home/loic/www/others/symfony-starter/src/Form/EventSubscriber/CustomerRegistrationFormSubscriber.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $existingCustomer->setUser($data->getUser());
-        $form->setData($existingCustomer);
+        
     }
 }

64) /home/loic/www/others/symfony-starter/src/Form/Extension/CustomerTypeExtension.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->addEventSubscriber(new AddUserFormSubscriber(AppUserType::class));
+        
     }
     /**
      * {@inheritdoc}

65) /home/loic/www/others/symfony-starter/src/Form/Extension/DateTypeExtension.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['widget' => 'single_text', 'html5' => false, 'format' => 'dd/MM/yyyy']);
+        
     }
     /**
      * {@inheritdoc}

66) /home/loic/www/others/symfony-starter/src/Form/Extension/DateTypeExtension.php:31    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['widget' => 'single_text', 'html5' => false, 'format' => 'dd/MM/yyyy']);
+        $resolver->setDefaults(['widget' => 'single_text', 'html5' => true, 'format' => 'dd/MM/yyyy']);
     }
     /**
      * {@inheritdoc}

67) /home/loic/www/others/symfony-starter/src/Form/Type/AddressType.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        parent::buildForm($builder, $options);
+        
     }
     /**

75) /home/loic/www/others/symfony-starter/src/Form/Type/AddressType.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver)
     {
-        $resolver->setDefaults(['data_class' => Address::class]);
+        
     }
     /**
      * {@inheritdoc}

77) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerRegistrationType.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options = [])
     {
         parent::buildForm($builder, $options);
-        $builder->add('firstName', TextType::class, ['label' => 'sylius.form.customer.first_name'])->add('lastName', TextType::class, ['label' => 'sylius.form.customer.last_name'])->add('phoneNumber', TextType::class, ['required' => false, 'label' => 'sylius.form.customer.phone_number']);
+        
     }
     /**
      * {@inheritdoc}

78) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerRegistrationType.php:38    [M] FalseValue

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options = [])
     {
         parent::buildForm($builder, $options);
-        $builder->add('firstName', TextType::class, ['label' => 'sylius.form.customer.first_name'])->add('lastName', TextType::class, ['label' => 'sylius.form.customer.last_name'])->add('phoneNumber', TextType::class, ['required' => false, 'label' => 'sylius.form.customer.phone_number']);
+        $builder->add('firstName', TextType::class, ['label' => 'sylius.form.customer.first_name'])->add('lastName', TextType::class, ['label' => 'sylius.form.customer.last_name'])->add('phoneNumber', TextType::class, ['required' => true, 'label' => 'sylius.form.customer.phone_number']);
     }
     /**
      * {@inheritdoc}
