79) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct($dataClass, array $validationGroups, RepositoryInterface $customerRepository)
     {
-        parent::__construct($dataClass, $validationGroups);
+        
         $this->customerRepository = $customerRepository;
     }
     /**

80) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options = [])
     {
-        $builder->add('email', EmailType::class, ['label' => 'sylius.form.customer.email'])->add('user', AppUserRegistrationType::class, ['label' => false, 'constraints' => [new Valid()]])->addEventSubscriber(new CustomerRegistrationFormSubscriber($this->customerRepository))->setDataLocked(false);
+        
     }
     /**
      * {@inheritdoc}

81) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:55    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options = [])
     {
-        $builder->add('email', EmailType::class, ['label' => 'sylius.form.customer.email'])->add('user', AppUserRegistrationType::class, ['label' => false, 'constraints' => [new Valid()]])->addEventSubscriber(new CustomerRegistrationFormSubscriber($this->customerRepository))->setDataLocked(false);
+        $builder->add('email', EmailType::class, ['label' => 'sylius.form.customer.email'])->add('user', AppUserRegistrationType::class, ['label' => true, 'constraints' => [new Valid()]])->addEventSubscriber(new CustomerRegistrationFormSubscriber($this->customerRepository))->setDataLocked(false);
     }
     /**
      * {@inheritdoc}

82) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:59    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options = [])
     {
-        $builder->add('email', EmailType::class, ['label' => 'sylius.form.customer.email'])->add('user', AppUserRegistrationType::class, ['label' => false, 'constraints' => [new Valid()]])->addEventSubscriber(new CustomerRegistrationFormSubscriber($this->customerRepository))->setDataLocked(false);
+        $builder->add('email', EmailType::class, ['label' => 'sylius.form.customer.email'])->add('user', AppUserRegistrationType::class, ['label' => false, 'constraints' => [new Valid()]])->addEventSubscriber(new CustomerRegistrationFormSubscriber($this->customerRepository))->setDataLocked(true);
     }
     /**
      * {@inheritdoc}

83) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => $this->dataClass, 'validation_groups' => $this->validationGroups]);
+        
     }
     /**
      * {@inheritdoc}

84) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:69    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => $this->dataClass, 'validation_groups' => $this->validationGroups]);
+        $resolver->setDefaults(['data_class' > $this->dataClass, 'validation_groups' => $this->validationGroups]);
     }
     /**
      * {@inheritdoc}

85) /home/loic/www/others/symfony-starter/src/Form/Type/Customer/CustomerSimpleRegistrationType.php:70    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => $this->dataClass, 'validation_groups' => $this->validationGroups]);
+        $resolver->setDefaults(['data_class' => $this->dataClass, 'validation_groups' > $this->validationGroups]);
     }
     /**
      * {@inheritdoc}

86) /home/loic/www/others/symfony-starter/src/Form/Type/DatePickerType.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver)
     {
-        parent::configureOptions($resolver);
+        
         $resolver->setDefaults(['widget' => 'single_text', 'format' => 'dd/MM/yyyy']);
     }
     /**

87) /home/loic/www/others/symfony-starter/src/Form/Type/DatePickerType.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function configureOptions(OptionsResolver $resolver)
     {
         parent::configureOptions($resolver);
-        $resolver->setDefaults(['widget' => 'single_text', 'format' => 'dd/MM/yyyy']);
+        
     }
     /**
      * {@inheritdoc}

89) /home/loic/www/others/symfony-starter/src/Form/Type/DateTimePickerType.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function configureOptions(OptionsResolver $resolver)
     {
         parent::configureOptions($resolver);
-        $resolver->setDefaults(['widget' => 'single_text', 'format' => 'dd/MM/yyyy H:i']);
+        
     }
     /**
      * {@inheritdoc}

91) /home/loic/www/others/symfony-starter/src/Form/Type/User/AdminUserType.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options) : void
     {
         parent::buildForm($builder, $options);
-        $builder->add('firstName', TextType::class, ['label' => 'sylius.ui.first_name'])->add('lastName', TextType::class, ['label' => 'sylius.ui.last_name']);
+        
     }
     /**
      * {@inheritdoc}

92) /home/loic/www/others/symfony-starter/src/Form/Type/User/AppUserRegistrationType.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options)
     {
-        $builder->add('plainPassword', RepeatedType::class, ['type' => PasswordType::class, 'first_options' => ['label' => 'sylius.form.user.password.label'], 'second_options' => ['label' => 'sylius.form.user.password.confirmation'], 'invalid_message' => 'sylius.user.plainPassword.mismatch']);
+        
     }
     /**
      * {@inheritdoc}

94) /home/loic/www/others/symfony-starter/src/Form/Type/User/AppUserType.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function buildForm(FormBuilderInterface $builder, array $options) : void
     {
         parent::buildForm($builder, $options);
-        $builder->remove('username')->remove('email');
+        
     }
     /**
      * {@inheritdoc}

95) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    public static function nameToCode($value)
+    protected static function nameToCode($value)
     {
         return str_replace([' ', '-'], '_', $value);
     }

96) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:26    [M] FunctionCall

--- Original
+++ New
@@ @@
      */
     public static function nameToCode($value)
     {
-        return str_replace([' ', '-'], '_', $value);
+        str_replace([' ', '-'], '_', $value);
+        return null;
     }
     /**
      * @param string $value

97) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    public static function nameToLowercaseCode($value)
+    protected static function nameToLowercaseCode($value)
     {
         return strtolower(self::nameToCode($value));
     }

98) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:36    [M] FunctionCall

--- Original
+++ New
@@ @@
      */
     public static function nameToLowercaseCode($value)
     {
-        return strtolower(self::nameToCode($value));
+        strtolower(self::nameToCode($value));
+        return null;
     }
     /**
      * @param string $value

99) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    public static function nameToUppercaseCode($value)
+    protected static function nameToUppercaseCode($value)
     {
         return strtoupper(self::nameToCode($value));
     }

100) /home/loic/www/others/symfony-starter/src/Formatter/StringInflector.php:46    [M] FunctionCall

--- Original
+++ New
@@ @@
      */
     public static function nameToUppercaseCode($value)
     {
-        return strtoupper(self::nameToCode($value));
+        strtoupper(self::nameToCode($value));
+        return null;
     }
     private function __construct()
     {

101) /home/loic/www/others/symfony-starter/src/Kernel.php:34    [M] TrueValue

--- Original
+++ New
@@ @@
      */
     protected function getContainerBaseClass()
     {
-        if (in_array($this->getEnvironment(), ['test', 'test_cached'], true)) {
+        if (in_array($this->getEnvironment(), ['test', 'test_cached'], false)) {
             return MockerContainer::class;
         }
         return parent::getContainerBaseClass();

103) /home/loic/www/others/symfony-starter/src/Kernel.php:55    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         $contents = (require $this->getProjectDir() . '/config/bundles.php');
         foreach ($contents as $class => $envs) {
-            if (isset($envs['all']) || isset($envs[$this->environment])) {
+            if (isset($envs['all']) && isset($envs[$this->environment])) {
                 (yield new $class());
             }
         }

104) /home/loic/www/others/symfony-starter/src/Kernel.php:61    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
             }
         }
     }
-    protected function configureContainer(ContainerBuilder $container, LoaderInterface $loader)
+    private function configureContainer(ContainerBuilder $container, LoaderInterface $loader)
     {
         $container->addResource(new FileResource($this->getProjectDir() . '/config/bundles.php'));
         $container->setParameter('container.dumper.inline_class_loader', true);

106) /home/loic/www/others/symfony-starter/src/Kernel.php:64    [M] TrueValue

--- Original
+++ New
@@ @@
     protected function configureContainer(ContainerBuilder $container, LoaderInterface $loader)
     {
         $container->addResource(new FileResource($this->getProjectDir() . '/config/bundles.php'));
-        $container->setParameter('container.dumper.inline_class_loader', true);
+        $container->setParameter('container.dumper.inline_class_loader', false);
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, 'glob');

107) /home/loic/www/others/symfony-starter/src/Kernel.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function configureContainer(ContainerBuilder $container, LoaderInterface $loader)
     {
         $container->addResource(new FileResource($this->getProjectDir() . '/config/bundles.php'));
-        $container->setParameter('container.dumper.inline_class_loader', true);
+        
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, 'glob');

109) /home/loic/www/others/symfony-starter/src/Kernel.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->setParameter('container.dumper.inline_class_loader', true);
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
-        $loader->load($confDir . '/{packages}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, 'glob');
+        
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }

110) /home/loic/www/others/symfony-starter/src/Kernel.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $confDir = $this->getProjectDir() . '/config';
         $loader->load($confDir . '/{packages}/*' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{packages}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, 'glob');
-        $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
+        
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }
     protected function configureRoutes(RouteCollectionBuilder $routes)

112) /home/loic/www/others/symfony-starter/src/Kernel.php:73    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         $loader->load($confDir . '/{services}' . self::CONFIG_EXTS, 'glob');
         $loader->load($confDir . '/{services}_' . $this->environment . self::CONFIG_EXTS, 'glob');
     }
-    protected function configureRoutes(RouteCollectionBuilder $routes)
+    private function configureRoutes(RouteCollectionBuilder $routes)
     {
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');

113) /home/loic/www/others/symfony-starter/src/Kernel.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function configureRoutes(RouteCollectionBuilder $routes)
     {
         $confDir = $this->getProjectDir() . '/config';
-        $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, '/', 'glob');
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }

114) /home/loic/www/others/symfony-starter/src/Kernel.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
-        $routes->import($confDir . '/{routes}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, '/', 'glob');
+        
         $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
     }
     protected function build(ContainerBuilder $container) : void

115) /home/loic/www/others/symfony-starter/src/Kernel.php:79    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $confDir = $this->getProjectDir() . '/config';
         $routes->import($confDir . '/{routes}/*' . self::CONFIG_EXTS, '/', 'glob');
         $routes->import($confDir . '/{routes}/' . $this->environment . '/**/*' . self::CONFIG_EXTS, '/', 'glob');
-        $routes->import($confDir . '/{routes}' . self::CONFIG_EXTS, '/', 'glob');
+        
     }
     protected function build(ContainerBuilder $container) : void
     {

116) /home/loic/www/others/symfony-starter/src/Kernel.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function build(ContainerBuilder $container) : void
     {
-        $container->addCompilerPass(new ServicesPass());
+        
     }
 }

117) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return ItemInterface
      */
-    public function createMenu(RequestStack $requestStack)
+    protected function createMenu(RequestStack $requestStack)
     {
         $menu = $this->factory->createItem('root');
         $this->addCustomerSubMenu($menu);

118) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function createMenu(RequestStack $requestStack)
     {
         $menu = $this->factory->createItem('root');
-        $this->addCustomerSubMenu($menu);
+        
         $this->addConfigurationSubMenu($menu);
         return $menu;
     }

119) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $menu = $this->factory->createItem('root');
         $this->addCustomerSubMenu($menu);
-        $this->addConfigurationSubMenu($menu);
+        
         return $menu;
     }
     /**

120) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function addCustomerSubMenu(ItemInterface $menu)
     {
         $customer = $menu->addChild('customer')->setLabel('sylius.ui.customer');
-        $customer->addChild('backend_customer', ['route' => 'sylius_backend_customer_index'])->setLabel('sylius.ui.customers')->setLabelAttribute('icon', 'users');
+        
         return $customer;
     }
     /**

121) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function addConfigurationSubMenu(ItemInterface $menu)
     {
         $configuration = $menu->addChild('configuration')->setLabel('sylius.ui.configuration');
-        $configuration->addChild('backend_address', ['route' => 'app_backend_address_index'])->setLabel('app.ui.addresses')->setLabelAttribute('icon', 'map');
+        
         $configuration->addChild('backend_admin_user', ['route' => 'sylius_backend_admin_user_index'])->setLabel('sylius.ui.admin_users')->setLabelAttribute('icon', 'lock');
         return $configuration;
     }
 }

122) /home/loic/www/others/symfony-starter/src/Menu/AdminMenuBuilder.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $configuration = $menu->addChild('configuration')->setLabel('sylius.ui.configuration');
         $configuration->addChild('backend_address', ['route' => 'app_backend_address_index'])->setLabel('app.ui.addresses')->setLabelAttribute('icon', 'map');
-        $configuration->addChild('backend_admin_user', ['route' => 'sylius_backend_admin_user_index'])->setLabel('sylius.ui.admin_users')->setLabelAttribute('icon', 'lock');
+        
         return $configuration;
     }
 }

123) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:61    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $configurationDefinition = new Configuration();
         $configuration = Yaml::parse($resource);
         $configuration = $processor->processConfiguration($configurationDefinition, ['routing' => $configuration]);
-        if (!empty($configuration['only']) && !empty($configuration['except'])) {
+        if (!empty($configuration['only']) || !empty($configuration['except'])) {
             throw new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
         }
         $routesToGenerate = ['show', 'index', 'create', 'update', 'delete', 'bulkDelete'];

124) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:61    [M] LogicalNot

--- Original
+++ New
@@ @@
         $configurationDefinition = new Configuration();
         $configuration = Yaml::parse($resource);
         $configuration = $processor->processConfiguration($configurationDefinition, ['routing' => $configuration]);
-        if (!empty($configuration['only']) && !empty($configuration['except'])) {
+        if (!empty($configuration['only']) && empty($configuration['except'])) {
             throw new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
         }
         $routesToGenerate = ['show', 'index', 'create', 'update', 'delete', 'bulkDelete'];

125) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:61    [M] LogicalNot

--- Original
+++ New
@@ @@
         $configurationDefinition = new Configuration();
         $configuration = Yaml::parse($resource);
         $configuration = $processor->processConfiguration($configurationDefinition, ['routing' => $configuration]);
-        if (!empty($configuration['only']) && !empty($configuration['except'])) {
+        if (empty($configuration['only']) && !empty($configuration['except'])) {
             throw new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
         }
         $routesToGenerate = ['show', 'index', 'create', 'update', 'delete', 'bulkDelete'];

126) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:62    [M] Throw_

--- Original
+++ New
@@ @@
         $configuration = Yaml::parse($resource);
         $configuration = $processor->processConfiguration($configurationDefinition, ['routing' => $configuration]);
         if (!empty($configuration['only']) && !empty($configuration['except'])) {
-            throw new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
+            new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
         }
         $routesToGenerate = ['show', 'index', 'create', 'update', 'delete', 'bulkDelete'];
         if (!empty($configuration['only'])) {

127) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:67    [M] LogicalNot

--- Original
+++ New
@@ @@
             throw new \InvalidArgumentException('You can configure only one of "except" & "only" options.');
         }
         $routesToGenerate = ['show', 'index', 'create', 'update', 'delete', 'bulkDelete'];
-        if (!empty($configuration['only'])) {
+        if (empty($configuration['only'])) {
             $routesToGenerate = $configuration['only'];
         }
         if (!empty($configuration['except'])) {

128) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:70    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (!empty($configuration['only'])) {
             $routesToGenerate = $configuration['only'];
         }
-        if (!empty($configuration['except'])) {
+        if (empty($configuration['except'])) {
             $routesToGenerate = array_diff($routesToGenerate, $configuration['except']);
         }
         $isApi = 'sylius.resource_api' === $type;

129) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:74    [M] Identical

--- Original
+++ New
@@ @@
         if (!empty($configuration['except'])) {
             $routesToGenerate = array_diff($routesToGenerate, $configuration['except']);
         }
-        $isApi = 'sylius.resource_api' === $type;
+        $isApi = 'sylius.resource_api' !== $type;
         /** @var MetadataInterface $metadata */
         $metadata = $this->resourceRegistry->get($configuration['alias']);
         $routes = $this->routeFactory->createRouteCollection();

130) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:80    [M] Coalesce

--- Original
+++ New
@@ @@
         /** @var MetadataInterface $metadata */
         $metadata = $this->resourceRegistry->get($configuration['alias']);
         $routes = $this->routeFactory->createRouteCollection();
-        $rootPath = sprintf('/%s/', $configuration['path'] ?? Urlizer::urlize($metadata->getPluralName()));
+        $rootPath = sprintf('/%s/', Urlizer::urlize($metadata->getPluralName()));
         $identifier = sprintf('{%s}', $configuration['identifier']);
         if (in_array('index', $routesToGenerate, true)) {
             $indexRoute = $this->createRoute($metadata, $configuration, $rootPath, 'index', ['GET'], $isApi);

131) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:83    [M] TrueValue

--- Original
+++ New
@@ @@
         $routes = $this->routeFactory->createRouteCollection();
         $rootPath = sprintf('/%s/', $configuration['path'] ?? Urlizer::urlize($metadata->getPluralName()));
         $identifier = sprintf('{%s}', $configuration['identifier']);
-        if (in_array('index', $routesToGenerate, true)) {
+        if (in_array('index', $routesToGenerate, false)) {
             $indexRoute = $this->createRoute($metadata, $configuration, $rootPath, 'index', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'index'), $indexRoute);
         }

132) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $identifier = sprintf('{%s}', $configuration['identifier']);
         if (in_array('index', $routesToGenerate, true)) {
             $indexRoute = $this->createRoute($metadata, $configuration, $rootPath, 'index', ['GET'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'index'), $indexRoute);
+            
         }
         if (in_array('create', $routesToGenerate, true)) {
             $createRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath : $rootPath . 'new', 'create', $isApi ? ['POST'] : ['GET', 'POST'], $isApi);

133) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:88    [M] TrueValue

--- Original
+++ New
@@ @@
             $indexRoute = $this->createRoute($metadata, $configuration, $rootPath, 'index', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'index'), $indexRoute);
         }
-        if (in_array('create', $routesToGenerate, true)) {
+        if (in_array('create', $routesToGenerate, false)) {
             $createRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath : $rootPath . 'new', 'create', $isApi ? ['POST'] : ['GET', 'POST'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'create'), $createRoute);
         }

134) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (in_array('create', $routesToGenerate, true)) {
             $createRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath : $rootPath . 'new', 'create', $isApi ? ['POST'] : ['GET', 'POST'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'create'), $createRoute);
+            
         }
         if (in_array('update', $routesToGenerate, true)) {
             $updateRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath . $identifier : $rootPath . $identifier . '/edit', 'update', $isApi ? ['PUT', 'PATCH'] : ['GET', 'PUT', 'PATCH'], $isApi);

135) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:93    [M] TrueValue

--- Original
+++ New
@@ @@
             $createRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath : $rootPath . 'new', 'create', $isApi ? ['POST'] : ['GET', 'POST'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'create'), $createRoute);
         }
-        if (in_array('update', $routesToGenerate, true)) {
+        if (in_array('update', $routesToGenerate, false)) {
             $updateRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath . $identifier : $rootPath . $identifier . '/edit', 'update', $isApi ? ['PUT', 'PATCH'] : ['GET', 'PUT', 'PATCH'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'update'), $updateRoute);
         }

136) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (in_array('update', $routesToGenerate, true)) {
             $updateRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath . $identifier : $rootPath . $identifier . '/edit', 'update', $isApi ? ['PUT', 'PATCH'] : ['GET', 'PUT', 'PATCH'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'update'), $updateRoute);
+            
         }
         if (in_array('show', $routesToGenerate, true)) {
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);

137) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:98    [M] TrueValue

--- Original
+++ New
@@ @@
             $updateRoute = $this->createRoute($metadata, $configuration, $isApi ? $rootPath . $identifier : $rootPath . $identifier . '/edit', 'update', $isApi ? ['PUT', 'PATCH'] : ['GET', 'PUT', 'PATCH'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'update'), $updateRoute);
         }
-        if (in_array('show', $routesToGenerate, true)) {
+        if (in_array('show', $routesToGenerate, false)) {
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'show'), $showRoute);
         }

138) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (in_array('show', $routesToGenerate, true)) {
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'show'), $showRoute);
+            
         }
         if (!$isApi && in_array('bulkDelete', $routesToGenerate, true)) {
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
