139) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:103    [M] LogicalNot

--- Original
+++ New
@@ @@
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'show'), $showRoute);
         }
-        if (!$isApi && in_array('bulkDelete', $routesToGenerate, true)) {
+        if ($isApi && in_array('bulkDelete', $routesToGenerate, true)) {
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'bulk_delete'), $bulkDeleteRoute);
         }

140) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:103    [M] TrueValue

--- Original
+++ New
@@ @@
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'show'), $showRoute);
         }
-        if (!$isApi && in_array('bulkDelete', $routesToGenerate, true)) {
+        if (!$isApi && in_array('bulkDelete', $routesToGenerate, false)) {
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'bulk_delete'), $bulkDeleteRoute);
         }

141) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:103    [M] LogicalAnd

--- Original
+++ New
@@ @@
             $showRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'show', ['GET'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'show'), $showRoute);
         }
-        if (!$isApi && in_array('bulkDelete', $routesToGenerate, true)) {
+        if (!$isApi || in_array('bulkDelete', $routesToGenerate, true)) {
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'bulk_delete'), $bulkDeleteRoute);
         }

142) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:105    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (!$isApi && in_array('bulkDelete', $routesToGenerate, true)) {
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'bulk_delete'), $bulkDeleteRoute);
+            
         }
         if (in_array('delete', $routesToGenerate, true)) {
             $deleteRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'delete', ['DELETE'], $isApi);

143) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:108    [M] TrueValue

--- Original
+++ New
@@ @@
             $bulkDeleteRoute = $this->createRoute($metadata, $configuration, $rootPath . 'bulk-delete', 'bulkDelete', ['DELETE'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'bulk_delete'), $bulkDeleteRoute);
         }
-        if (in_array('delete', $routesToGenerate, true)) {
+        if (in_array('delete', $routesToGenerate, false)) {
             $deleteRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'delete', ['DELETE'], $isApi);
             $routes->add($this->getRouteName($metadata, $configuration, 'delete'), $deleteRoute);
         }

144) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:110    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         if (in_array('delete', $routesToGenerate, true)) {
             $deleteRoute = $this->createRoute($metadata, $configuration, $rootPath . $identifier, 'delete', ['DELETE'], $isApi);
-            $routes->add($this->getRouteName($metadata, $configuration, 'delete'), $deleteRoute);
+            
         }
         return $routes;
     }

145) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:121    [M] Identical

--- Original
+++ New
@@ @@
      */
     public function supports($resource, $type = null) : bool
     {
-        return 'sylius.resource' === $type || 'sylius.resource_api' === $type;
+        return 'sylius.resource' !== $type || 'sylius.resource_api' === $type;
     }
     /**
      * {@inheritdoc}

146) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:121    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     public function supports($resource, $type = null) : bool
     {
-        return 'sylius.resource' === $type || 'sylius.resource_api' === $type;
+        return 'sylius.resource' === $type && 'sylius.resource_api' === $type;
     }
     /**
      * {@inheritdoc}

147) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:121    [M] Identical

--- Original
+++ New
@@ @@
      */
     public function supports($resource, $type = null) : bool
     {
-        return 'sylius.resource' === $type || 'sylius.resource_api' === $type;
+        return 'sylius.resource' === $type || 'sylius.resource_api' !== $type;
     }
     /**
      * {@inheritdoc}

148) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:156    [M] FalseValue

--- Original
+++ New
@@ @@
      *
      * @return Route
      */
-    private function createRoute(MetadataInterface $metadata, array $configuration, string $path, string $actionName, array $methods, bool $isApi = false) : Route
+    private function createRoute(MetadataInterface $metadata, array $configuration, string $path, string $actionName, array $methods, bool $isApi = true) : Route
     {
         $defaults = ['_controller' => $metadata->getServiceId('controller') . sprintf(':%sAction', $actionName)];
         if ($isApi && 'index' === $actionName) {

149) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:162    [M] Identical

--- Original
+++ New
@@ @@
     private function createRoute(MetadataInterface $metadata, array $configuration, string $path, string $actionName, array $methods, bool $isApi = false) : Route
     {
         $defaults = ['_controller' => $metadata->getServiceId('controller') . sprintf(':%sAction', $actionName)];
-        if ($isApi && 'index' === $actionName) {
+        if ($isApi && 'index' !== $actionName) {
             $defaults['_sylius']['serialization_groups'] = ['Default'];
         }
         if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {

150) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:162    [M] LogicalAnd

--- Original
+++ New
@@ @@
     private function createRoute(MetadataInterface $metadata, array $configuration, string $path, string $actionName, array $methods, bool $isApi = false) : Route
     {
         $defaults = ['_controller' => $metadata->getServiceId('controller') . sprintf(':%sAction', $actionName)];
-        if ($isApi && 'index' === $actionName) {
+        if ($isApi || 'index' === $actionName) {
             $defaults['_sylius']['serialization_groups'] = ['Default'];
         }
         if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {

151) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:165    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($isApi && 'index' === $actionName) {
             $defaults['_sylius']['serialization_groups'] = ['Default'];
         }
-        if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {
+        if ($isApi && in_array($actionName, ['show', 'create', 'update'], false)) {
             $defaults['_sylius']['serialization_groups'] = ['Default', 'Detailed'];
         }
         if ($isApi && 'delete' === $actionName) {

152) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:165    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($isApi && 'index' === $actionName) {
             $defaults['_sylius']['serialization_groups'] = ['Default'];
         }
-        if ($isApi && in_array($actionName, ['show', 'create', 'update'], true)) {
+        if ($isApi || in_array($actionName, ['show', 'create', 'update'], true)) {
             $defaults['_sylius']['serialization_groups'] = ['Default', 'Detailed'];
         }
         if ($isApi && 'delete' === $actionName) {

158) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:174    [M] TrueValue

--- Original
+++ New
@@ @@
         if (isset($configuration['grid']) && 'index' === $actionName) {
             $defaults['_sylius']['grid'] = $configuration['grid'];
         }
-        if (isset($configuration['form']) && in_array($actionName, ['create', 'update'], true)) {
+        if (isset($configuration['form']) && in_array($actionName, ['create', 'update'], false)) {
             $defaults['_sylius']['form'] = $configuration['form'];
         }
         if (isset($configuration['serialization_version'])) {

159) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:174    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (isset($configuration['grid']) && 'index' === $actionName) {
             $defaults['_sylius']['grid'] = $configuration['grid'];
         }
-        if (isset($configuration['form']) && in_array($actionName, ['create', 'update'], true)) {
+        if (isset($configuration['form']) || in_array($actionName, ['create', 'update'], true)) {
             $defaults['_sylius']['form'] = $configuration['form'];
         }
         if (isset($configuration['serialization_version'])) {

160) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:183    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (isset($configuration['section'])) {
             $defaults['_sylius']['section'] = $configuration['section'];
         }
-        if (!empty($configuration['criteria'])) {
+        if (empty($configuration['criteria'])) {
             $defaults['_sylius']['criteria'] = $configuration['criteria'];
         }
         if (array_key_exists('filterable', $configuration)) {

161) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:189    [M] TrueValue

--- Original
+++ New
@@ @@
         if (array_key_exists('filterable', $configuration)) {
             $defaults['_sylius']['filterable'] = $configuration['filterable'];
         }
-        if (isset($configuration['templates']) && in_array($actionName, ['show', 'index', 'create', 'update'], true)) {
+        if (isset($configuration['templates']) && in_array($actionName, ['show', 'index', 'create', 'update'], false)) {
             $defaults['_sylius']['template'] = sprintf('%s/%s.html.twig', $configuration['templates'], $actionName);
         }
         if (isset($configuration['redirect']) && in_array($actionName, ['create', 'update'], true)) {

162) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:189    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (array_key_exists('filterable', $configuration)) {
             $defaults['_sylius']['filterable'] = $configuration['filterable'];
         }
-        if (isset($configuration['templates']) && in_array($actionName, ['show', 'index', 'create', 'update'], true)) {
+        if (isset($configuration['templates']) || in_array($actionName, ['show', 'index', 'create', 'update'], true)) {
             $defaults['_sylius']['template'] = sprintf('%s/%s.html.twig', $configuration['templates'], $actionName);
         }
         if (isset($configuration['redirect']) && in_array($actionName, ['create', 'update'], true)) {

163) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:192    [M] TrueValue

--- Original
+++ New
@@ @@
         if (isset($configuration['templates']) && in_array($actionName, ['show', 'index', 'create', 'update'], true)) {
             $defaults['_sylius']['template'] = sprintf('%s/%s.html.twig', $configuration['templates'], $actionName);
         }
-        if (isset($configuration['redirect']) && in_array($actionName, ['create', 'update'], true)) {
+        if (isset($configuration['redirect']) && in_array($actionName, ['create', 'update'], false)) {
             $defaults['_sylius']['redirect'] = $this->getRouteName($metadata, $configuration, $configuration['redirect']);
         }
         if (isset($configuration['permission'])) {

164) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:192    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (isset($configuration['templates']) && in_array($actionName, ['show', 'index', 'create', 'update'], true)) {
             $defaults['_sylius']['template'] = sprintf('%s/%s.html.twig', $configuration['templates'], $actionName);
         }
-        if (isset($configuration['redirect']) && in_array($actionName, ['create', 'update'], true)) {
+        if (isset($configuration['redirect']) || in_array($actionName, ['create', 'update'], true)) {
             $defaults['_sylius']['redirect'] = $this->getRouteName($metadata, $configuration, $configuration['redirect']);
         }
         if (isset($configuration['permission'])) {

165) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:203    [M] Coalesce

--- Original
+++ New
@@ @@
             $defaults['_sylius']['vars'] = $configuration['vars']['all'];
         }
         if (isset($configuration['vars'][$actionName])) {
-            $vars = $configuration['vars']['all'] ?? [];
+            $vars = [];
             $defaults['_sylius']['vars'] = array_merge($vars, $configuration['vars'][$actionName]);
         }
         if ('bulkDelete' === $actionName) {

166) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:207    [M] Identical

--- Original
+++ New
@@ @@
             $vars = $configuration['vars']['all'] ?? [];
             $defaults['_sylius']['vars'] = array_merge($vars, $configuration['vars'][$actionName]);
         }
-        if ('bulkDelete' === $actionName) {
+        if ('bulkDelete' !== $actionName) {
             $defaults['_sylius']['paginate'] = false;
             $defaults['_sylius']['repository'] = ['method' => 'findById', 'arguments' => ['$ids']];
         }

167) /home/loic/www/others/symfony-starter/src/Routing/ResourceLoader.php:208    [M] FalseValue

--- Original
+++ New
@@ @@
             $defaults['_sylius']['vars'] = array_merge($vars, $configuration['vars'][$actionName]);
         }
         if ('bulkDelete' === $actionName) {
-            $defaults['_sylius']['paginate'] = false;
+            $defaults['_sylius']['paginate'] = true;
             $defaults['_sylius']['repository'] = ['method' => 'findById', 'arguments' => ['$ids']];
         }
         return $this->routeFactory->createRoute($path, $defaults, [], [], '', [], $methods);

168) /home/loic/www/others/symfony-starter/src/Validator/Initializer/CustomerInitializer.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         if ($object instanceof CustomerInterface) {
             $emailCanonical = $this->canonicalizer->canonicalize($object->getEmail());
-            $object->setEmailCanonical($emailCanonical);
+            
         }
     }
 }

169) /home/loic/www/others/symfony-starter/src/View/FoundationTranslatedView.php:35    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     protected function buildPreviousMessage($text)
     {
-        return sprintf('%s', $text);
+        sprintf('%s', $text);
+        return null;
     }
     protected function buildNextMessage($text)
     {

171) /home/loic/www/others/symfony-starter/src/View/FoundationView.php:30    [M] NewObject

--- Original
+++ New
@@ @@
 {
     protected function createDefaultTemplate()
     {
-        return new FoundationTemplate();
+        new FoundationTemplate();
+        return null;
     }
     protected function getDefaultProximity()
     {

172) /home/loic/www/others/symfony-starter/src/View/FoundationView.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getDefaultProximity()
     {
-        return 3;
+        return 2;
     }
     /**
      * {@inheritdoc}

173) /home/loic/www/others/symfony-starter/src/View/FoundationView.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getDefaultProximity()
     {
-        return 3;
+        return 4;
     }
     /**
      * {@inheritdoc}

174) /home/loic/www/others/symfony-starter/src/View/FoundationView.php:35    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getDefaultProximity()
     {
-        return 3;
+        return -3;
     }
     /**
      * {@inheritdoc}

175) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:36    [M] FunctionCall

--- Original
+++ New
@@ @@
      */
     public function container()
     {
-        return sprintf('<ul class="%s" role="navigation" aria-label="Pagination">%%pages%%</ul>', $this->option('css_container_class'));
+        sprintf('<ul class="%s" role="navigation" aria-label="Pagination">%%pages%%</ul>', $this->option('css_container_class'));
+        return null;
     }
     /**
      * @param int $page

176) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    public function pageWithTextAndClass($page, $text, $class)
+    protected function pageWithTextAndClass($page, $text, $class)
     {
         $href = $this->generateRoute($page);
         return $this->linkLi($class, $href, $text);

177) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:95    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string
      */
-    public function previousDisabledClass()
+    protected function previousDisabledClass()
     {
         return $this->option('css_prev_class') . ' ' . $this->option('css_disabled_class');
     }

178) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:127    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string
      */
-    public function nextDisabledClass()
+    protected function nextDisabledClass()
     {
         return $this->option('css_next_class') . ' ' . $this->option('css_disabled_class');
     }

179) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:150    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function first()
     {
-        return $this->page(1);
+        return $this->page(0);
     }
     /**
      * @param int $page

180) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:150    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     public function first()
     {
-        return $this->page(1);
+        return $this->page(2);
     }
     /**
      * @param int $page

181) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:195    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    protected function linkLi($class, $href, $text)
+    private function linkLi($class, $href, $text)
     {
         $liClass = $class ? sprintf(' class="%s"', $class) : '';
         return sprintf('<li%s><a href="%s">%s</a></li>', $liClass, $href, $text);

182) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:199    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function linkLi($class, $href, $text)
     {
         $liClass = $class ? sprintf(' class="%s"', $class) : '';
-        return sprintf('<li%s><a href="%s">%s</a></li>', $liClass, $href, $text);
+        sprintf('<li%s><a href="%s">%s</a></li>', $liClass, $href, $text);
+        return null;
     }
     /**
      * @param string $class

183) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:208    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    protected function spanLi($class, $text)
+    private function spanLi($class, $text)
     {
         $liClass = $class ? sprintf(' class="%s"', $class) : '';
         return sprintf('<li%s><span>%s</span></li>', $liClass, $text);
     }

184) /home/loic/www/others/symfony-starter/src/View/Template/FoundationTemplate.php:212    [M] FunctionCall

--- Original
+++ New
@@ @@
     protected function spanLi($class, $text)
     {
         $liClass = $class ? sprintf(' class="%s"', $class) : '';
-        return sprintf('<li%s><span>%s</span></li>', $liClass, $text);
+        sprintf('<li%s><span>%s</span></li>', $liClass, $text);
+        return null;
     }
 }
